// pages/company/company.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    url: "/image/d1.jpg",
    value1: "维意定制家具始创于2003年，是佛山唯尚家具制造有限公司的核心品牌，公司位于广东佛山南海区大沥镇虹岭工业园博爱东路与虹领路交界处，是一家集设计、制造、服务于一体的家具企业。由国际影星李冰冰代言。",
    value2: "维意用全屋家私定制实现家居风格的统一，从设计、选材与规格、色彩，到功能、环保与配套升级，每一件家居产品都必须单独定制，但却都是全屋定制体系的构成单元。每个空间都有多种风格主体实现个性的需要，才能称为全屋家私定制。",
    value3: "致力于达到“物超所值的顾客体验”，是唯意的经营哲学与愿景。让顾客亲眼看到、亲身体验到产品和服务所能给他带来的价值。让顾客弄清这些价值是怎么产生的，又有着怎样的理论依据，并以此来验证每一位顾客所看到或体验到的不是商家玩的噱头而是真正的事实。"
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})