// pages/service/service.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    list: [
      {
        url: "/image/f1.jpg",
        title: "01商品详情",
        content: "维意风格[郁金飘香]，以纯白色、深棕色为主，整体感觉典雅、细腻。该风格的面板是“胡桃木+白牡丹吸塑”，融合了现代与中式的设计风格，在款式和色调上强调简约、舒适、温馨。此设计去繁就简、张弛有度，体现了现代人追求简约精致的高质量生活理念。"
      },
      {
        url: "/image/f2.jpg",
        title: "02商品详情",
        content: "维意风格[阿尔卑斯]，以奶白色、木黄色为主，整体感觉清新素雅。该风格的面板是“白蜡木+香雪意境吸塑”组合，共同营造淡雅的意境。此设计强调结构简单与功能舒适和实用，略偏简欧风格，着重在于突显出装饰主义风味的古典质感，因此简约而不失格调。"
      },
      {
        url: "/image/f1.jpg",
        title: "03商品详情",
        content: "维意风格[郁金飘香]，以纯白色、深棕色为主，整体感觉典雅、细腻。该风格的面板是“胡桃木+白牡丹吸塑”，融合了现代与中式的设计风格，在款式和色调上强调简约、舒适、温馨。此设计去繁就简、张弛有度，体现了现代人追求简约精致的高质量生活理念。"
      }
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})